<?php
/* * *********************************************************
* Json输出code对应的提示信息
* @Author  linhecheng<linhechengbush@live.com>
* @Date: 2017/1/13 14:35
* *********************************************************** */

return [
    0 => '操作成功',
    1 => '操作失败',
    2 => '参数错误',
    3 => '数据没有变化',

    /*登录相关*/
    10001 => '验证码错误！',
    10002 => '参数错误',
    10003 => '用户已被禁用',
    10005 => '用户名或密码错误',

    /*权限相关*/
    10100 => '您所有的用户组没有操作该用户[组]的权限!',
    10101 => '该应用下有菜单不能删除',

    /*用户相关*/
    10201 => '旧密码错误',
    10202 => '两次输入密码不一致',

];